In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
tabela = pd.DataFrame({'nome':['rafael','joão','rafael','maria'], 'nota':[10,9,8,7]})
tabela

     nome  nota
0  rafael    10
1    joão     9
2  rafael     8
3   maria     7

In [4]:
tabela2 = np.array(tabela)
tabela2

array([['rafael', 10],
       ['joão', 9],
       ['rafael', 8],
       ['maria', 7]], dtype=object)

In [5]:
tabela3 = tabela.copy()

In [6]:
tabela3.loc[0,'nota'] = 3

In [7]:
tabela

     nome  nota
0  rafael    10
1    joão     9
2  rafael     8
3   maria     7

In [8]:
tabela3

     nome  nota
0  rafael     3
1    joão     9
2  rafael     8
3   maria     7

In [9]:
tabela.nome

0    rafael
1      joão
2    rafael
3     maria
Name: nome, dtype: object

In [10]:
tabela['nome']

0    rafael
1      joão
2    rafael
3     maria
Name: nome, dtype: object

In [11]:
tabela.loc[2,'nome']

'rafael'

In [12]:
tabela.groupby('nome').mean()

        nota
nome
joão     9.0
maria    7.0
rafael   9.0

In [13]:
tabela.groupby('nome').count()

        nota
nome
joão       1
maria      1
rafael     2

In [14]:
tabela.nota[tabela.nome=='rafael']

0    10
2     8
Name: nota, dtype: int64

In [15]:
tabela

     nome  nota
0  rafael    10
1    joão     9
2  rafael     8
3   maria     7